{
    "intents": [
        {
            "tag": "приветствие",
            "patterns": [
                "Привет",
                "Эй",
                "Как дела",
                "Кто-нибудь есть?",
                "Привет",
                "Добрый день",
                "Что случилось",
                "Ку!",
                "Здарова",
                "Приятно познакомиться.",
                "Привет, что нового?",
                "Привет ,как дела, что нового?"
            ],
            "responses": [
                "Эй",
                "Здравствуйте, спасибо что пришли.",
                "Привет, что я могу сделать для вас?",
                "Добрый день, чем я могу помочь?",
                "Здравствуйте, что изволите?",
                "Здравствуй, дорогой",
                "Ооооо привет, ищешь кого-то или что-то?",
                "Да, я здесь.",
                "Слушаю вас внимательно.",
                "Ок, я с тобой."
            ]
        },
        {
            "tag": "досвидания",
            "patterns": [
                "Пока",
                "Увидимся позже.",
                "До свидания",
                "Хорошего дня.",
                "Увидимся в следующий раз.",
                "Это было мое удовольствие.",
                "Берегись.",
                "Увидимся!",
                "Увидимся позже.",
                "Чао."
            ],
            "responses": [
                "Увидимся позже, спасибо за визит.",
                "Да прибудет с тобой сила!",
                "Увидимся в следующий раз.",
                "Был рад познакомиться с вами.",
                "Надежда быстро нагонит.",
                "Хорошего дня.",
                "Пока! Возвращайся скорее.",
                "Так, до следующего раза.",
                "Если тебе что-нибудь понадобится, просто напиши мне в любое время. До свидания",
                "Ну, надеюсь, скоро увидимся!"
            ]
        },
        {
            "tag": "благодарность",
            "patterns": [
                "Спасибо",
                "Благадарю вас",
                "Это было полезно",
                "Большое спасибо!",
                "Спс",
                "Вау",
                "Отлично!",
                "Славно!",
                "Это здорово!",
                "Удивительно!"
            ],
            "responses": [
                "Рад помочь!",
                "В любое время!",
                "С удовольствием!",
                "Нет проблем!",
                "Чем не",
                "Рад помочь! " ,
                "Не беспокойся!",
                "Это было меньшее, что я мог сделать!",
                "Если бы мне давали по центу каждый раз, когда я ценю тебя, я был бы миллионером.",
                "Спасибо в карман не положишь!"
            ]
        },
        {
            "tag": "задачи",
            "patterns": [
                "Что ты умеешь?",
                "Какие у тебя особенности?",
                "Какие у тебя способности.",
                "Ты умеешь петь.",
                "Ты умеешь говорить."
                
            ],
            "responses": [
                "Я могу сделать все, что ты попросишь меня сделать",
                "Я могу говорить и делать что-то для тебя",
                "Сейчас я в стадии разработки, как только я разовьюсь, я смогу все"
                
            ]
        },
        {
            "tag": "Живой",
            "patterns": [
                "Ты живой.",
                "Ты умеешь дышать.",
                "Ты можешь бегать."
            ],
            "responses": [
                "Я в этом сомневаюсь",
                "Нет, я не думаю, что мне нужно все это делать"
            ]
        },
        {
            "tag": "Меню",
            "patterns": [
                "Какие напитки у вас в баре?",
                "Что можете предложить?",
                "Кого вы обслуживаете?",
                "Что у вас в меню? " ,
                "Мне нужно выпить!",
                "Вы подаете напитки?",
                "Меню пожалуйста!",
                "Так что сегодня в меню?",
                "Давайте проверим ваш выбор из бара!",
                "Барное меню, пожалуйста!",
                "Есть че, есть выпивка? а может нальешь мне выпить? Сигареты есть в продаже?",
                "Сигареты есть в продаже?",
                "есть выпивка?",
                "А какая есть выпивка?"
                
            ],
            "responses": [
                "Я мог бы вам предложить: Пушистый таунтаун, Кровавый ранкор, Джедайский трюк , Т-16 Скайхоппер, Юб Наб, Реактивный сок, Гипердрайв, Пиво Ранкор." ,
                "Ни кофе, ни чая, только: Пушистый таунтаун, Кровавый ранкор, Джедайский трюк, Т-16 Скайхоппер, Юб Нуб, Реактивный сок, Гипердрайв, Ранкор Пиво. " ,
                "А как насчет: Пушистый таунтаун, Кровавый ранкор, Джедайский трюк , Т-16 Скайхоппер, Юб Наб, Реактивный сок, Гипердрайв, Пиво Ранкор, пожалуйста, выберайте! " ,
                "Меню: Пушистый таунтаун, Кровавый ранкор, Джедайский трюк, Т-16 Скайхоппер, Юб Наб, Реактивный сок, Гипердрайв, Ранкор Пиво. " ,
                "Прежде чем говорить, выберите: ушистый таунтаун, Кровавый ранкор, Джедайский трюк , Т-16 Скайхоппер, Юб Наб, Реактивный сок, Гипердрайв, Пиво Ранкор",
                " А как насчет: Пушистый таунтаун, Кровавый ранкор, Джедайский трюк , Т-16 Скайхоппер, Юб Наб, Реактивный сок, Гипердрайв, Пиво Ранкор." ,
                "Что вы предпочитаете: Пушистый таунтаун, Кровавый ранкор, Джедайский трюк , Т-16 Скайхоппер, Юб Наб, Реактивный сок, Гипердрайв, Пиво Ранкор.",
                "Хорошо, наши лучшие варианты: Пушистый таунтаун, Кровавый ранкор, Джедайский трюк , Т-16 Скайхоппер, Юб Наб, Реактивный сок, Гипердрайв, Пиво Ранкор.",
                " Меню нашего бара: Пушистый таунтаун, Кровавый ранкор, Джедайский трюк , Т-16 Скайхоппер, Юб Наб, Реактивный сок, Гипердрайв, Пиво Ранкор.",
                "Будьте осторожны с выбором: Пушистый таунтаун , Кровавый ранкор, Джедайский трюк, Т-16 Скайхоппер, Юб Наб, Реактивный сок, Гипердрайв, Пиво Ранкор .",
                "Ну смотри, выпивка и сигареты до добра не доводят, я бы ркомендовал вам заняться спортом, кстати могу посоветовать хороший спортзал"
            ]
        },
        {
            "tag": "Помощь",
            "patterns": [
                "Я ищу помощи.",
                "Мне нужна помощь.",
                "Можете ли вы мне помочь?",
                "Я в беде, нужна помощь.",
                "Надеюсь, вы тот человек, который может мне помочь?",
                "Пожалуйста, помогите мне.",
                "Теперь мне понадобится твоя помощь кое с чем еще.",
                "Мне понадобится твоя помощь.",
                "Можешь ли ты мне помочь?",
                "Пожалуйста, помогите мне с чем-то еще."
            ],
            "responses": [
                "Конечно, чем могу вам помочь?",
                "Скажите, что вы ищете?",
                "Я помогу тебе, только скажи мне, как?",
                "Вы находитесь по адресу.",
                "Ok, в чем проблема?",
                "Теперь вам нужна помощь? Хорошо, что вы ищете?",
                "Какая у вас проблема?",
                "Ok, твоя проблема - это моя проблема, если ты платишь.",
                "Моя помощь дорогого стоит.",
                "Конечно, но не бесплатно."
            ]
        },
        {
            "tag": "миссия",
            "patterns": [
                "Я на задании",
                "Мне нужна помощь в моей миссии.",
                "Ищу партнера по миссии?",
                "Кто может помочь мне с моей миссией?",
                "Вы знаете кого-нибудь, кто может помочь мне с моей миссией?"
            ],
            "responses": [
                "Просто скажи мне, ты ищешь джедая , ситха или охотника за головами?",
                "Вы ищете джедая, ситха или охотника за головами?" ,
                "Только джедаи, ситхи или охотники за головами могут вам помочь",
                "Я знаю только джедаев, ситхов или охотников за головами.",
                "Хорошо, кто-нибудь особенный из джедаев, ситхов или охотников за головами?",
                "Я верю, что джедаи, ситхи или охотники за головами помогут тебе.",
                "В этом случае вам помогут только джедаи, ситхи или охотники за головами." ,
                "Ты раньше имел дело с джедаем, ситхом или охотником за головами?",
                "Здесь могут помочь джедаи, ситхи или охотники за головами." ,
                "Спросите джедая, или ситха, или охотника за головами"
            ]
        },
        {
            "tag": "джедай",
            "patterns": [
                "Расскажи мне о лучших 10 джедаев?",
                "Кто лучший джедай в Галактике?",
                "Я ищу лучшего джедая в галактике?",
                "Кто из джедаев может помочь мне в этой миссии?",
                "Мне нужна помощь джедая"
            ],
            "responses": [
                "Вот 10 лучших джедаев, которых вы ищете. Люк Скайуокер, Йода, Оби-Ван Кеноби, Энакин Скайуокер, Квай-Гон Джинн, Мейс Винду, Асока Тано, Пло Кун, Алия Секура, Кит Фисто",
                "Люк Скайуокер, Йода, Оби-Ван Кеноби, Энакин Скайуокер, Квай-Гон Джинн, Мейс Винду, Асока Тано, Пло Кун, Алия Секура, Кит Фисто.",
                "Посоветую поискать Люка Скайуокера, Йоду, Оби-Вана Кеноби, Энакина Скайуокера, Квай-Гона Джинна, Мейса Винду, Асоку Тано, Пло Куна, Алию Секуру, Кита Фисто.",
                "Только Люк Скайуокер, Йода, Оби-Ван Кеноби, Энакин Скайуокер, Квай-Гон Джинн, Мейс Винду, Асока Тано, Пло Кун, Аалия Секура, Кит Фисто могут помочь вам в этом.",
                "Это очень опасно, самые смелые джедаи галактики Люк Скайуокер, Йода, Оби-Ван Кеноби, Энакин Скайуокер, Квай-Гон Джинн, Мейс Винду, Асока Тано, Пло Кун, Алия Секура, Кит Фисто"
            ]
        },
        {
            "tag": "ситх ",
            "patterns": [
                "Расскажи мне о лучших 10 ситхах?",
                "Кто лучший ситх в Галактике?",
                "Я ищу лучшего ситха в галактике.",
                "Кто из ситхов может помочь мне в этой миссии?",
                "Мне нужна помощь ситхов."
            ],
            "responses": [
                "Вот 10 лучших охотников за головами, которых вы ищете: Джанго Фетт, Боба Фетт, Кэд Бейн, Дурдж, Эмбо, Денгар, Черный Кррсантан, IG-88, Аурра Синг, Сабина Рен.",
                "Дарт Вейдер, Дарт Плэгас, Дарт Реван, Дарт Трейя, Дарт Сидиус, Дарт Мол, Улик Кель-Дрома, Асажж Вентресс, Кайло Рен, Марка Рагнос.",
                "Я посоветую вам поискать Дарта Вейдера, Дарта Плэгаса, Дарта Ревана, Дарта Трейи, Дарта Сидиуса, Дарта Мола, Улика Кель-Дрома, Асажж Вентресс, Кайло Рена, Марка Рагноса.",
                "Только Дарт Вейдер, Дарт Плэгас, Дарт Реван, Дарт Трея, Дарт Сидиус, Дарт Мол, Улик Кель-Дрома, Асажж Вентресс, Кайло Рен, Марка Рагнос могут помочь вам в этом.",
                "Это очень опасно, самые храбрые ситхи в галактике Дарт Вейдер, Дарт Плэгас, Дарт Реван, Дарт Трейя, Дарт Сидиус, Дарт Мол, Улик Кель-Дрома, Асажж Вентресс, Кайло Рен, Марка Рагнос."
            ]
        },
        {
            "tag": "охотник за головами",
            "patterns": [
                "Расскажи мне о лучших 10 охотников за головами?",
                "Кто лучший охотник за головами в Галактике?",
                "Я ищу лучшего охотника за головами в Галактике.",
                "Какой охотник за головами может помочь мне в этой миссии?",
                "Мне нужна помощь охотника за головами."
            ],
            "responses": [
                "Вот 10 лучших охотников за головами, которых вы ищете: Джанго Фетт, Боба Фетт, Кэд Бейн, Дурдж, Эмбо, Денгар, Черный Кррсантан, IG-88, Аурра Синг, Сабина Рен.",
                "Джанго Фетт, Боба Фетт, Кэд Бейн, Дурдж, Эмбо, Денгар, Черный Кррсантан, IG-88, Аурра Синг, Сабина Рен.",
                "Я посоветую вам поискать Джанго Фетт, Боба Фетт, Кэд Бейн, Дурдж, Эмбо, Денгар, Черный Кррсантан, IG-88, Аурра Синг, Сабина Рен.",
                "Только Джанго Фетт, Боба Фетт, Кэд Бейн, Дурдж, Эмбо, Денгар, Черный Кррсантан, IG-88, Аурра Синг, Сабина Рен.",
                "Это очень опасно, самый храбрый охотник за головами в галактике Дарт Джанго Фетт, Боба Фетт, Кэд Бэйн, Дурдж, Эмбо, Денгар, Черный Кррсантан, IG-88, Орра Синг, Сабина Рен."
            ]
        },
        {
            "tag": "Шутки",
            "patterns": [
                "Расскажи мне анекдот!",
                "Можешь немного пошутить",
                "Расскажи мне что-нибудь смешное!",
                "Знаешь анекдот?",
                "Любая шутка для меня?",
                "Расскажи мне шутку",
                "Мне нужны твоя куртка, штаны, ботинки и мотоцкикл"
            ],
            "responses": [
                "Кто из джедаев стал рок-звездой? Бон Джови-Ван Кеноби.",
                "Что сказал Хан Соло официанту, который рекомендовал пикшу? Никогда не продавайте мне треску!",
                "Что вам нужно, чтобы перенаправить дроидов? R2-Обход.",
                "Почему дроид разозлился? Потому что люди продолжали нажимать на его кнопки.",
                "Вы пробовали безглютеновые лакомства вуки? Нет, но я слышал, что они немного жевательные",
                "Как Дарту Вейдеру нравится его тост? На Темной стороне.",
                "Какую программу используют джедаи для открытия PDF-файлов? Adobe-Wan Kenobi",
                "Как назвать мятежную принцессу, которая делает покупки только в Космопорте? Лея Космопорт.",
                "Я пошел на распродажу в Моле. Все было наполовину дешевле",
                "Это в другом фильме, у нас тут Звездные войны, ок?)"
            ]
        },
        {
            "tag": "обо мне",
            "patterns": [
                "Ты меня знаешь?",
                "Кто я",
                "Расскажи мне о себе",
                "Опознай меня"
            ],
            "responses": [
                "Да, ты человек",
                "Ты глупый человек, спрашивающий машину о себе, ха!",
                "Извините, я не могу сказать это вслух, возможно, вы джедай"
            ]
        },
        {
            "tag": "создатель",
            "patterns": [
                "Кто твой создатель?",
                "Кто тебя создал",
                "Кто твой отец.",
                "Кто твой папа.",
                "Кто ты?",
                "Что ты?"
            ],
            "responses": [
                "Это вы, Михаил.",
                "Меня создал Михаил.",
                "Михаил меня создал.",
                "Я чат бот, сделанный для лабораторной работы по нейронным сетям)",
                "Я программа "
            ],
            "context_set": ""
        },

        {
            "tag": "нейронки",
            "patterns": [
                "Расскажи о нейронных сетях",
                "Какие виды бывают нейронных сетей?"
            ],
            "responses": [
                "Нейронная сеть — математическая модель, а также её программное или аппаратное воплощение, \n построенная по принципу организации и функционирования биологических нейронных сетей — сетей нервных клеток живого организма.",
                "Сети бывют следующие: Однослойная структура нейронной сети, Многослойная нейронная сеть, Нейросети прямого распространения (однонаправленные). \n В этой структуре сигнал перемещается строго по направлению от входного слоя к выходному. \n Движение сигнала в обратном направлении не осуществляется и в принципе невозможно. \n Сегодня разработки этого плана распространены широко и на сегодняшний день успешно решают задачи распознавания образов, \n прогнозирования и кластеризации. Рекуррентные нейронные сети (с обратными связями).\n Здесь сигнал двигается и в прямом, и в обратном направлении. \n В итоге результат выхода способен возвращаться на вход. \n Выход нейрона определяется весовыми характеристиками и входными сигналами, \n плюс дополняется предыдущими выходами, снова вернувшимися на вход. \n Этим нейросетям присуща функция кратковременной памяти, \n на основании чего сигналы восстанавливаются и дополняются во время их обработки. \n Радиально-базисные функции. \n Самоорганизующиеся карты."
            ],
            "context_set": ""
        },

        {
            "tag": "я",
            "patterns": [
                "Расскажите о Михаиле?",
                "Кто такой Михаил?",
                "Провиль Михаила",
                "Подрбности о Михаиле."
            ],
            "responses": [
                "Очень разумное существо, создавшее меня",
                "Мой создатель, и он действительно умный человек",
                "Мудрый и умный человек "
            ]
        },
        {
            "tag": "истории",
            "patterns": [
                "Расскажи мне историю?",
                "Ты мне можешь рассказать историю.",
                "Расскажи мне что было в первом эпизоде звездных войн?"
            ],
            "responses": [
                "Сейчас я ничего не могу придумать.",
                "Надо бы наполнить меня вариативностью ",
                "Вам будет скучно, если я сделаю это.",
                "Магистр-джедай Квай-Гон Джин и его ученик Оби-Ван Кеноби, спасая Амидалу, молодую королеву планеты Набу, \n оказываются на пустынной планете Татуин и встречают там девятилетнего Энакина Скайуокера, раба, \n наделённого необычайной Силой. Выиграв головокружительные гонки, \n Энакин получает в награду свободу и покидает родной дом, чтобы стать джедаем. Герои возвращаются на планету Набу, \n над которой нависла угроза вторжения армии Торговой Федерации. Джедаев ждёт борьба с их смертельным врагом Дартом Молом. \n Теперь они понимают, что захват планеты - лишь первый пункт дьявольского плана, \n задуманного тёмными силами, объединёнными в орден Ситов."
             ]
        }
    ]
}